Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་དག་ལེ་ལོ་ནམ་ཡང་ཡོད་མིན་ཏེ།
en: Never showing any sign of laziness.

source: དེ་ལྟར་དེ་དག་འཇིག་རྟེན་ཕན་ཕྱིར་སྤྲོ། །རྒྱལ་པོའི་སྲིད་དང་ནོར་དང་འབྲུ་སྲོག་གཏོང་། །
en: In this way they bring benefit to the world. “Having discarded royalty, a life of riches and abundance,

source: དེ་དག་སེམས་ནི་གཞན་དུ་མི་འགྱུར་ཏེ། །
en: Their minds are set on nothing else.

source: བྱིན་ནས་དགའ་ཆེན་པོ་རྙེད་པར་འགྱུར། །
en: When one gives, the most supreme satisfaction is attained.

source: སྦྱིན་ཞིང་གཏོང་ལ་བྱང་ཆུབ་རྙེད་མི་དཀའ། །
en: For one who gives away and relinquishes, awakening is not hard to reach.

source: ཕ་དང་མ་དང་བུ་ནི་སྡུག་པ་ལྟར། །སློང་དང་འཇིག་རྟེན་ཀུན་ལ་དེ་བཞིན་ཏེ། །
en: “Like the affection parents have for their child, Such is theirs for those in need, for the whole world.

source: གང་གིས་བྱང་ཆུབ་སྤྱོད་མཆོག་སྤྱད་པ་རྣམས། །སྦྱིན་ཚེ་རྟག་ཏུ་ཕྲག་དོག་མེད་པར་འགྱུར། །
en: Those who make the most of supreme awakened conduct Are never miserly when they give.

source: དེ་དག་མཐོང་ན་མི་ཁྲོ་སྟེ། །
en: “They show no anger no matter what they see,

source: ཇི་ལྟར་སྔོན་གྱི་བཞིན་དུ་སྨྲ། །
en: But continue conversing as they would have before.

source: མི་མཛའ་དག་དང་རྟག་མཛའ་ཞིང་། །སྐྲག་པ་རྣམས་ལ་འཇིགས་མེད་སྦྱིན། །
en: They are always friendly to those who are unfriendly, And grant fearlessness to those who are afraid.

source: དེ་ལ་དངོས་པོ་གང་ཡོད་པ། །སློང་བ་ལ་ནི་སྲི་བ་མེད། །
en: “From those who ask, they do not conceal Anything they might possess.

source: ཆོས་འདོད་པར་ནི་རྟག་འགྱུར་ཏེ། །རྒྱལ་སྲིད་འདོད་པར་མི་འགྱུར་རོ། །
en: It is always the Dharma that they wish for; They have no interest in power.

source: འབྱུང་བར་རྟག་ཏུ་སྨྲ་བྱེད་ཅིང་། །ཆོས་ཀྱི་སྦྱིན་པའང་སྦྱིན་པར་བྱེད།
en: “They always speak of renunciation, Giving the gift of Dharma.

source: འདོད་ལ་བརྐམ་པ་མ་གཏོགས་པར། །སུ་ཞིག་རྒྱལ་སྲིད་འདོད་པར་འགྱུར། །
en: What is it apart from pleasure That one who seeks power longs for?

source: འདོད་པའི་རྒྱལ་སྲིད་མི་འདོད་ཅིང་། །མཐོ་རིས་བདེ་བ་འདོད་མ་ཡིན། །
en: “They do not seek pleasures or power, And they have no interest in the joys of heaven.

source: སངས་རྒྱས་བྱང་ཆུབ་ཡོངས་ཚོལ་ཞིང་། །གྲགས་པ་ཆེན་པོ་སྦྱིན་པ་སྦྱིན།
en: The celebrated ones are generous, Searching for the awakening of a buddha.

source: བདག་དང་ནོར་རྫས་གཞན་དག་ཀྱང་། །མང་པོ་མྱུར་དུ་གཏོང་བ་ནི། །དེ་དག་བྱང་ཆུབ་དམ་པའི་མཆོག །ནམ་ཡང་གཏོང་བར་མི་འགྱུར་རོ། །
en: “They are quick to abandon the self And the hoarding of other valuables, But they will never ever abandon Supreme awakening.

source: མཁས་པ་གཟུགས་ནི་མི་འདོད་དེ། །
en: “The wise ones have no interest in the body,

source: ལོངས་སྤྱོད་དག་ཀྱང་འདོད་མ་ཡིན། །
en: Nor are they drawn toward possessions.

source: མཐོ་རིས་དག་ཀྱང་དེ་མི་འདོད། །
en: “They have no interest in heaven either,

source: མྱ་ངན་འདའ་བའང་འདོད་མ་ཡིན། །
en: And they are not drawn toward nirvāṇa.

source: ལམ་ཤེས་ལམ་ལ་མཁས་པ་དག ། གང་དག་བཤེས་པར་གྱུར་པ་ལ། །བརྟེན་པ་དག་ཏུ་མི་བྱེད་དེ། ། སྲིད་པ་མེད་པ་འདོད་པར་འགྱུར། །
en: “They do not put too much stock In praise they might receive. Those who know the path and are skilled in the path Long for freedom from existence.

source: ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དེ་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དག་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་དོ། །
en: “This, Śāriputra, is the perfection of generosity of the bodhisatvas, the great beings, and by engaging in this perfection of generosity, the bodhisatvas train in the bodhisatva path.”

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ་སྟེ་དྲུག་པའོ།། །།
en: This is the sixth chapter, “The Perfection of Generosity.”

source: བམ་པོ་དགུ་པ།
en: Chapter 7:

source: དེ་ལ་གང་ལ་བརྩོན་པས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་གསུམ་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལེགས་པར་སྤྱོད་པ་སྟེ། གསུམ་གང་ཞེ་ན། ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པའོ། ། དེ་ལ་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་གང་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ནི། སྲོག་གཅོད་པ་སྤངས་པ་ཡིན། མ་བྱིན་པར་ལེན་པ་སྤངས་པ་ཡིན། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པ་ཡིན་ཏེ། འདི་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་ཞེས་བྱའོ། ། གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ནི། བརྫུན་དུ་སྨྲ་བ་སྤངས་པ་ཡིན། ཕྲ་མ་དང་ངག་རྩུབ་པོ་དང་། ཚིག་ཀྱལ་པ་སྤངས་པ་ཡིན་ཏེ། འདི་ནི་ངག་གིས་ལེགས་པར་སྤྱོད་པ་ཞེས་བྱའོ། ། གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ནི། བརྣབ་སེམས་མེད། གནོད་སེམས་མེད་ཅིང་། ཡང་དག་པར་ལྟ་བ་ཡིན་ཏེ། འདི་ནི་ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་ཞེས་བྱའོ། །
en: “What is the perfection of morality of bodhisatvas, great beings, like? How do bodhisatvas conduct themselves when they practice the bodhisatva path? Śāriputra, the conduct of bodhisatvas is good in three ways. What are these three ways? They are good bodily conduct, good verbal conduct, and good mental conduct. Now, what does good bodily conduct imply? Śāriputra, good bodily conduct implies that a bodhisatva abstains from taking life, abstains from taking what is not given, and abstains from sexual misconduct. Moreover, Śāriputra, good verbal conduct implies that a bodhisatva abstains from lying and abstains from slander, harsh words, and inane chatter. Finally, good mental conduct implies that a bodhisatva is not covetous, is without malice, and holds right views.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་གང་། ངག་གིས་ལེགས་པར་སྤྱོད་པ་གང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་གང་ཡིན་སྙམ་མོ། ། དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། ལུས་ཀྱི་ལས་གང་། སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་མ་བྱས་པ་དེ་ནི། ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་ཞེས་བྱའོ་སྙམ་མོ། ། དེ་ལ་ངག་གིས་ལེགས་པར་སྤྱོད་པ་གང་ཞེ་ན། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ངག་གི་ལས་གང་བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ངག་རྩུབ་པོ་དང་། ཚིག་ཀྱལ་པ་མ་སྨྲས་པ་དེ་ནི། ངག་གིས་ལེགས་པར་སྤྱོད་པ་ཞེས་བྱའོ་སྙམ་མོ། ། དེ་ལ་ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་གང་ཞེ་ན། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཡིད་ཀྱི་ལས་གང་། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་མ་བྱས་པ་དེ་ནི་ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་ཞེས་བྱའོ་སྙམ་མོ། །
en: “He reflects, ‘What is good bodily conduct, good verbal conduct, and good mental conduct?’ He reflects, ‘The acts of the body that should not be carried out are taking life, taking what is not given, and sexual misconduct. This is what is meant by good bodily conduct.’ What about good verbal conduct? He reflects, ‘The verbal acts that should not be carried out are lying, slander, harsh words, and inane chatter. This is what is meant by good verbal conduct.’ What about good mental conduct? He reflects, ‘The acts of the mind that should not be carried out are being covetous, being malicious, and holding wrong views. This is what is meant by good mental conduct.’

source: དེ་འདི་ལྟར་ཚུལ་བཞིན་སོ་སོར་རྟོག་སྟེ། ། ལས་གང་ལུས་ཀྱིས་མ་བྱས་པ་དང་། ལས་གང་ངག་དང་། ཡིད་ཀྱིས་མ་བྱས་པ་དེ་ཅི་གདགས་པར་ནུས་སམ། དེ་འདི་ལྟར་ཚུལ་བཞིན་གྱིས། རྟོག་པ་ན་འདི་སྙམ་དུ་སེམས་ཏེ། ལས་གང་ལུས་ཀྱིས་མ་བྱས་པ་དང་། ལས་གང་ངག་དང་ཡིད་ཀྱིས་མ་བྱས་པ་དེ་སྔོན་པོ་འམ། སེར་པོ་འམ། དམར་པོ་འམ། དཀར་པོ་འམ། ལེབ་རྒན་ནམ། ཤེལ་གྱི་ཁ་དོག་ཏུ་གདགས་པར་མི་ནུས་ཏེ མིག་གིས་ཤེས་པར་བྱ་བ་མ་ཡིན། རྣ་བས་ཤེས་པར་བྱ་བ་མ་ཡིན། སྣས་ཤེས་པར་བྱ་བ་མ་ཡིན། ལྕེས་ཤེས་པར་བྱ་བ་མ་ཡིན། ལུས་ཀྱིས་ཤེས་པར་བྱ་བ་མ་ཡིན། ཡིད་ཀྱིས་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་སྐྱེས་པ་མ་ཡིན། བསྐྱེད་པ་མ་ཡིན། བྱུང་བ་མ་ཡིན། ཟིན་པ་མ་ཡིན་ཏེ། དེ་ནི་ལས་གང་གིས་ཀྱང་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ། ། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཚུལ་ཁྲིམས་དེ་ནི། གང་མངོན་པར་འདུས་མ་བྱས་པའོ། ། གང་མངོན་པར་འདུ་མི་བྱེད་པ་དེ་ལ་གདགས་པ་གང་ཡང་མེད་དོ། ། གང་གདགས་པ་མེད་པ། དེ་ལ་བདག་མངོན་པར་ཆགས་པར་མི་བྱའོ་སྙམ་ནས། དེ་འདི་ལྟར་ལེགས་པར་སྤྱད་པའི་ཚུལ་ཁྲིམས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། གང་གི་ཚུལ་ཁྲིམས་དེ་དང་། ཚུལ་ཁྲིམས་དེ་གང་དུ་བསྔོ་བ། དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། ། དེ་དེ་ལྟར་མཐོང་བས། འཇིག་ཚོགས་ལ་ལྟ་བ་གང་གིས། ཚུལ་ཁྲིམས་སམ། འཆལ་པའི་ཚུལ་ཁྲིམས་ལ། སོ་སོར་རྟོག་པར་འགྱུར་བའི་འཇིག་ཚོགས་ལ་ལྟ་བ་མི་སློང་ངོ་། དེ་དེ་ལྟར་མཐོང་བས་སྡོམ་པ་དང་། ཆོ་ག་དང་། སྤྱོད་པ་དང་། སྤྱོད་ཡུལ་ཤེས་བཞིན་དུ་སྤྱོད་པར་འགྱུར་ཏེ། ཤེས་བཞིན་དུ་སྤྱོད་པས་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཞེས་བྱའོ། ། དེ་བདག་ཏུ་དམིགས་ཤིང་མི་སྤྱོད། ཕ་རོལ་ཏུ་དམིགས་ཤིང་མི་སྤྱོད་དེ། དེ་ཚུལ་ཁྲིམས་མ་ཉམས་པ་དང་། ཚུལ་ཁྲིམས་མཆོག་ཏུ་མི་འཛིན་པ་ཡིན་ནོ། ། བདག་ཏུ་དམིགས་ན་ཚུལ་ཁྲིམས་སུ་དམིགས་པར་འགྱུར་གྱི། གང་བདག་ཏུ་མི་དམིགས་པ་དེ་ནི་ཚུལ་ཁྲིམས་སུ་མི་དམིགས་སོ། ། གང་ཚུལ་ཁྲིམས་སུ་མི་དམིགས་པ་དེ་ནི་བསླབ་པ་ཉམས་པར་མི་བྱེད་དོ། ། གང་སླབ་པ་ཉམས་པར་མི་བྱེད་པ་དེ་ཚུལ་ཁྲིམས་ཉམས་པར་མི་བྱེད་དེ། ཚུལ་ཁྲིམས་མཆོག་ཏུ་མི་འཛིན་ཏོ། ། ཅིའི་ཕྱིར་མཆོག་ཏུ་མི་འཛིན་ཅེ་ན། དེས་གཞན་ལས་ཆོས་ཐམས་ཅད་ཤེས་སོ། ། གཞན་གང་ཡིན་པ་དེ་ལ་བདག་མེད་དོ། ། གང་བདག་མེད་པ་དེ་ལ་ཅི་ཞིག་ཡོངས་སུ་གཟུང་བར་བྱ།
en: “He then investigates whether the abstention from acts of body, speech, or mind can be conceived of. Through sincere investigation he comes to see that it is impossible to conceive of the abstention from acts of body, speech, or mind as being, for example, blue, yellow, red, white, crimson, crystal, or silver. It is not something that can be perceived by the eye, the ear, the nose, the tongue, the body, or the mind. Why? It does not arise, is not created, does not occur, and is not engaged with; it cannot be understood as being performed by someone. His conclusion will be that morality is not conditioned in any way, and anything that is not conditioned is not something that can be conceived of. Something that cannot be conceived of is not something one can apply oneself to. In this way, he does not focus on the morality of good conduct. In the same way, he does not focus on someone who is moral or on the morality to which he applies himself. When he has seen this, the view of self-entity will not arise in him, as it is the view of self-entity that leads one to be intent on analyzing morality and immorality. When he has seen this, he is thoughtful in his commitments, his observances, his practices, and his responsibilities, as it is through thoughtful conduct that one comes to be known as a moral individual. However, he does not cling to the idea of a self, and he does not cling to the idea of another, so his morality is never given up; his morality remains untarnished. Clinging to the idea of a self leads to clinging to the idea of morality, but one who does not cling to the idea of a self does not cling to the idea of morality. One who does not cling to the idea of morality does not violate the training, and as they do not violate their training, neither will they violate their morality, although they will still not cling to it. The reason they do not cling to it is that they know that all phenomena exist in relation to other phenomena. That which exists in relation to other phenomena has no self, and when there is no self, what is there to cling to?”

source: ལུས་ཀྱིས་དག་ཅིང་ངག་གིས་དག་པ་དང་། །ཡིད་ཀྱིས་དག་ཅིང་རྟག་ཏུ་སྤྱོད་པ་དག ། དག་པའི་བརྟུལ་ཞུགས་ལ་ནི་རྟག་གནས་པ། །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ལྡན། །
en: “Maintaining purity of body, purity of speech, And purity of mind, always keeping his conduct pure, Abiding at all times with his discipline pure, A bodhisatva like this is known as one who is moral.

source: ཤིན་ཏུ་བཟང་པོའི་ལས་ལམ་བཅུ་པོ་འདི། །གང་དག་སྲུང་བ་བྱང་ཆུབ་སེམས་དཔའ་མཁས། །
en: “There are ten wholesome forms of conduct That the learned bodhisatva will follow.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱིས་གང་མ་བྱས། །
en: By avoiding the acts of body, speech, and mind that they proscribe,

source: དེ་ནི་མཁས་པ་ཚུལ་ཁྲིམས་ལྡན་ཞེས་བྱ། །
en: The learned one practices morality.

source: གང་དག་མ་བྱས་མ་བསྐྱེད་མི་ལེན་པ། །དེ་ལ་ཁ་དོག་མེད་ཅིང་དབྱིབས་ཀྱང་མེད། །
en: “Something that has not been done, that does not occur, and that is not expressed Has no color, nor indeed any shape.

source: གང་ལ་ཁ་དོག་མེད་ཅིང་དབྱིབས་མེད་པ། །དེ་ལ་གདགས་པ་ནམ་ཡང་མི་དམིགས་སོ། །
en: Something that has neither color nor shape Is not something that can be conceived. It cannot be apprehended.

source: རྟག་ཏུ་ཚུལ་ཁྲིམས་མ་བྱས་འདུས་མ་བྱས། །དེ་ནི་མིག་གིས་བལྟ་བར་མི་ནུས་ཏེ། །
en: “As morality, therefore, is always unconditioned and never made up, It is not something that can be seen by the eye.

source: རྣ་བ་སྣ་དང་ལྕེ་ཡིས་ཤེས་མ་ཡིན། ། ལུས་དང་ཡིད་ཀྱིས་ཤེས་པར་བྱ་མ་ཡིན། །
en: Neither can it be perceived by the ear, the nose, The tongue, the body, or the mind.

source: གང་དེ་དབང་པོས་ཤེས་པར་མི་ནུས་པ། །དེ་ལ་སྙིང་རྗེ་འཇུག་པ་ནུས་མ་ཡིན། །
en: “What the senses cannot perceive Cannot possibly inspire compassion.

source: དེ་ལྟར་ཚུལ་ཁྲིམས་ཡང་དག་མཐོང་བ་དེ། །
en: When he sees pure morality in this way,

source: ནམ་ཡང་ཚུལ་ཁྲིམས་དམིགས་པར་མི་གནས་སོ། །
en: He will never cling to the idea of morality.

source: ཚུལ་ཁྲིམས་ལྡན་ཞེས་ཡིད་ཀྱིས་མི་སྙེམས་ཤིང་། །བདག་ཏུ་འཛིན་པས་ཚུལ་ཁྲིམས་མི་སྲུང་སྟེ། །
en: “He will not be conceited, thinking of himself as moral, And he will not guard his morality with a selfish attitude.

source: ཚུལ་ཁྲིམས་སྲུང་ཡང་ཚུལ་ཁྲིམས་འདུ་ཤེས་མེད། ། དེ་ནི་ཁྲིམས་ལྡན་བྱང་ཆུབ་སྤྱད་སྤྱོད་པ།
en: Someone who practices the bodhisatva path maintains his morality By guarding his morality without having any conception of morality.

source: །འཇིག་ཚོགས་ལ་ནི་ལྟ་བ་གང་སེལ་བ། །དེ་ནི་ལྟ་བར་ནམ་དུའང་མི་འགྱུར་རོ། །
en: “One who does not nurture the view of self-entity Will never tend toward views.

source: གང་ལ་ལྟ་མེད་དེ་ལ་གནས་མེད་དེ། །ཚུལ་ཁྲིམས་འཆལ་དང་ཚུལ་ཁྲིམས་དེ་མི་སྙེམས། །ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་ཀུན་སྲུང་བ། །དེ་ཡི་ཆོ་ག་བསམ་དུ་མེད་པར་འགྱུར། །
en: One who holds no views will not be biased, Arrogantly distinguishing between morality and immorality. “The practice of one who is committed to the Dharma And adheres to its principles is inconceivable.

source: རབ་ཏུ་འབྱུང་ཞིང་རབ་ཏུ་བསྲུངས་པ་ནི། །ཚུལ་ཁྲིམས་ལྡན་ཏེ་གཞན་ལ་རྩོད་མི་བྱེད། །
en: One who is moral has a good foundation and will guard his morality well. He will be involved with nothing else.

source: བདག་མེད་འདུ་ཤེས་ཚུལ་ཁྲིམས་མི་དམིགས་ཏེ། །
en: “Understanding no self means not clinging to morality—

source: བདག་མེད་དེ་ལ་ཚུལ་ཁྲིམས་དམིགས་པའང་མེད། །
en: Where there is no self, neither will there be morality.

source: བདག་དང་དེ་བཞིན་ཚུལ་ཁྲིམས་གང་སྙེམས་པ། །རྟག་ཏུ་འཇིག་པའི་མཐའ་ཞེས་ངས་བཤད་དོ། །
en: I say that those who are arrogant about themselves and their morality Will always be victims of fear.

source: བདག་མེད་སྨྲ་བ་ཚུལ་ཁྲིམས་མི་སེམས་ཏེ། །
en: “The one who teaches no self is not conceited about morality.

source: བདག་མེད་སྨྲ་བ་ཚུལ་ཁྲིམས་གནས་མ་ཡིན། །
en: The one who teaches no self does not rely on morality.

source: བདག་མེད་སྨྲ་བ་ཚུལ་ཁྲིམས་རྟོག་མ་ཡིན། །
en: The one who teaches no self does not conceptualize morality.

source: ཚུལ་ཁྲིམས་མ་ཉམས་ཚུལ་ཁྲིམས་སྐྱོན་མེད་པ། །བདག་ནི་ཚུལ་ཁྲིམས་ལྡན་ཞེས་མི་སློང་ངོ་། །
en: “The morality of someone who does not consider himself To be a moral person is undeteriorated, untarnished.

source: བདག་ལ་བདག་མེད་ཚུལ་ཁྲིམས་འདུ་ཤེས་མེད། །
en: Where there is no self there is no conception of morality.

source: ཤེས་རབ་ཟབ་མོ་བྱང་ཆུབ་སྤྱད་པ་སྤྱོད། །
en: This is the profound wisdom of the path of awakening.

source: འཇིགས་མེད་གང་དག་ཚུལ་ཁྲིམས་འདི་འདྲ་བ། །ནམ་ཡང་ཚུལ་ཁྲིམས་འཆལ་པར་དེ་མི་འགྱུར། །
en: “The morality of one who has confidence is such That he will never let his discipline falter.

source: ཐམས་ཅད་ཆོས་ནི་གང་དག་མི་དམིགས་པ། །དེ་ཡི་ཚུལ་ཁྲིམས་དེ་ནི་འཕགས་པས་བསྔགས། །
en: The morality praised by the noble ones Does not involve clinging to any idea of any phenomena.

source: བྱིས་པ་གང་དག་བདག་ཏུ་ལྟ་གནས་ཏེ། །
en: “The immature, who are stuck in the idea of a self,

source: བདག་ནི་ཚུལ་ཁྲིམས་ལྡན་ཞེས་ཁྲིམས་སྲུང་ཞིང་། །བསྲུངས་ནས་ཚུལ་ཁྲིམས་འབྲས་བུ་མྱོང་བ་དེ། ། ངན་འགྲོ་གསུམ་པོ་ཀུན་ལས་མི་ཐར་ཏོ། །
en: Guard their discipline, thinking they are moral. But the fruit of their labors will only be The inability to escape the three lower realms.

source: གང་དག་བདག་ཏུ་ལྟ་བ་ཀུན་སྤངས་པ། །དེ་ནི་ང་དང་ང་ཞེས་བྱ་མི་འབྱུང་། །
en: “Those who have abandoned the idea of a self Do not entertain notions of I and mine.

source: ཚུལ་ཁྲིམས་ལྡན་པ་དེ་ལ་ལྟ་མེད་དེ། །
en: They do not consider themselves to be moral,

source: དེ་ནི་ཕྱིར་ཡང་ལོག་ལྟུང་མི་འཇིགས་སོ། །
en: And they need have no more fear of falling into the lower realms.

source: འདི་འདྲ་བ་ཡི་ཚུལ་ཁྲིམས་གང་ཤེས་པ། །དེ་ལ་འཆལ་པའི་ཚུལ་ཁྲིམས་བལྟ་མི་ནུས། །
en: “One who understands the practice of morality in this way Will certainly not come to regard anything as immoral.

source: སྲིད་པ་གསུམ་ན་དེ་བདག་མི་མཐོང་ན། །
en: As no self can be found within the three forms of existence,

source: ཁྲིམས་དང་ཚུལ་འཆལ་མ་ཐོང་འགྱུར་སྨོས་ཅི་དགོས། །
en: Why even look for morality and immorality?

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ཚུལ་ཁྲིམས་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པའི་ཆོས་བཅུ་འདུས་པར་འགྱུར་རོ། ། བཅུ་གང་ཞེ་ན། དད་པའི་བསམ་པ་འདུས་པར་འགྱུར་བ་དང་། བརྩོན་འགྲུས་ཀྱི་བསམ་པ་འདུས་པར་འགྱུར་བ་དང་། རབ་ཏུ་འདུན་པ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་རྒྱ་ཆེན་པོ་ལ་དད་པ་དང་། འཕགས་པ་ལ་ལྡང་བ་བྱེད་པ་དང་། བླ་མ་ལ་རིམ་གྲོ་བྱེད་པ་དང་། སློབ་དཔོན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། ཆོས་ཚོལ་བ་ལ་འཇུག་པར་བྱེད་པ་དང་། བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་ཞིང་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་བྱེད་པ་སྟེ། ཤཱ་རིའི་བུ་དེ་ལྟར་ཚུལ་ཁྲིམས་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཆོས་བཅུ་པོ་དེ་དག་འདུས་པར་འགྱུར་རོ། ། དེ་ཆོས་བཅུ་པོ་དེ་དག་ལ་རབ་ཏུ་གནས་ནས་དགེ་བའི་ཆོས་རྣམས་ཡང་དག་པར་སྒྲུབ་བོ། །དགེ་བའི་ཆོས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལེགས་པར་སྤྱོད་པ་གསུམ་པོ་འདི་དག་ཉིད་དེ་ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པའོ། ། ལེགས་པར་སྤྱོད་པ་གསུམ་པོ་དེ་དག་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་དེའི་བྱང་ཆུབ་གང་དང་འབྲེལ་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་ལོ། །
en: “Śāriputra, there are ten attitudes that the bodhisatva who practices morality will adopt. What are these ten attitudes? He adopts an attitude of faith. He adopts an attitude of vigor. He has strong yearning. He trusts in the complexity of actions and the ripening of their fruits. He shows respect to his teachers. He serves his gurus. He is attentive in the presence of his teachers. He is fully committed to his search for the Dharma. He has no concern for his body or his life in his pursuit of awakening. These, Śāriputra, are the ten attitudes that the bodhisatva who practices morality will adopt. When he masters these ten practices, he will have perfected wholesome practice. What is wholesome practice? It is to follow the three kinds of good conduct, that is to say, good bodily, verbal, and mental conduct. Basing himself on these three kinds of good conduct, the bodhisatva, the great being, applies himself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva. This will lead to awakening.”

source: འདི་ལ་དེའི་ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ། དེ་ལ་འདི་སྐད་ཅེས་བྱའོ། །
en: This is the way things are, and concerning it the following verses were recited:

source: སངས་རྒྱས་དག་གིས་བསྔགས་པ་ཡི། །དགེ་བའི་ལས་རྣམས་ལུས་ཀྱིས་བྱེད།
en: “He applies himself to wholesome bodily conduct, Which is praised by the buddhas, And he serves the noble ones

source: གང་ལས་ཐོས་པ་རྙེད་འགྱུར་བའི། །སློབ་དཔོན་ལ་ཡང་རིམ་གྲོ་བྱེད། །
en: From whom he learns. “He shows great respect to those Who apply themselves to the teaching.

source: སེམས་ཅན་ཐམས་ཅད་དོན་གྱི་ཕྱིར། །བྱམས་པའི་སེམས་ལྡན་ཕྲག་དོག་མེད། །
en: In order to be able to help all sentient beings, He maintains a loving mind, free of envy.

source: ཆོས་ལས་བརྩམས་ཏེ་གང་ཟག་ལ། །རི་མོ་དག་ནི་རབ་ཏུ་བྱེད། ། ངག་ནི་ཤིན་ཏུ་སྡོམ་གྱུར་ཏེ། །དེ་ནི་མི་སྙན་ཚིག་མི་སྨྲ།
en: “He guards his speech And speaks no unfriendly word. Those who are filled with inspiration Will never speak a harsh word.

source: །འདི་ནི་འདུན་དང་ལྡན་པའི་མཚན། ། ནམ་དུའང་ངག་རྩུབ་མི་སྨྲའོ། །
en: “His thoughts are gentle, And he has no evil desires.

source: ཡིད་ནི་དགེ་བའི་ཡིད་དུ་འགྱུར། །ནམ་དུའང་སྡིག་པ་མི་འདོད་དོ། ། བྱམས་སེམས་གུས་དང་བཅས་པ་ཡི། །བསམ་པ་ཉིད་ཀྱིས་རྟག་ཏུ་ལྟ།
en: With a mind of love and devotion, He constantly examines the way things are. “He listens to the Dharma, The teachings of the Victorious One, with devotion.

source: །རྒྱལ་བས་བསྟན་པ་ཐོས་གྱུར་ནས། ། ཆོས་འདི་ལ་ནི་གུས་དང་བཅས། །
en: One who is devoted to the Dharma Will quickly attain awakening.

source: ཆོས་ལ་གུས་པར་བྱས་པས་ན། །མྱུར་དུ་བྱང་ཆུབ་རྣམ་འཚང་རྒྱ། །ཆོས་བཅུ་པོ་དེ་དག་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱེད་དེ། ཐ་ན་ཆུ་རྫ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “Relying on these ten practices, the bodhisatva applies himself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.

source: གཞན་ཡང་ཤྭ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་བསྐྱེད་པ་བཅུ་བསྐྱེད་དེ། བཅུ་གང་ཞེ་ན། ཀྱེ་མའོ་ལུས་འདི་ནི་ན་བ་སྟེ། ཁམས་ནི་སྦྲུལ་གདུག་པ་བཞིན་དུ་རྟག་པར་ཕན་ཚུན་མི་འཕྲོད་པའོ། ། སྡུག་བསྔལ་མང་བའོ། ། ཉེས་པ་མང་བའོ། ། སྨྱོ་བ་དང་། འབྲས་དང་། ཕོལ་མིག་དང་། མེ་དབལ་དང་། གཡན་པ་དང་། རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་གྱིས་གང་སྟེ། ནད་དང་འདྲ། ཕོལ་མིག་དང་འདྲ། ཟུག་རྔུ་དང་འདྲ། ཆུ་བོ་དང་འདྲ། གནོད་པ་དང་འདྲ། གཡོ་བ། འཇིག་པ། སྙིང་པོ་མེད་པ། ཉམ་ཆུང་བ། ཤིག་ཤིག་པོ། ཡུན་ཐུང་བ། སྐད་ཅིག་པ། དུར་ཁྲོད་དུ་འཇིག་པ་སྟེ།
en: “Furthermore, Śāriputra, the bodhisatva cultivates ten thoughts. What are these ten thoughts? ‘How terribly diseased this body is! Its elements are in constant imbalance, as if ravaged by poison. It is very painful. It is full of flaws. It is full of imbalances, boils, blisters, infections, rashes, wind, bile, and phlegm. It is like a disease. It is like a boil. It is like a thorn. It is like a stream. It is like a wound. It is unstable, feeble, insubstantial, weak, decrepit, transient, and temporary, and it will end up in the charnel ground. Therefore, I will put this insubstantial body to good use.’

source: སྙིང་པོ་མེད་པས་ལུས་ལས་སྙིང་པོ་བླང་ངོ་སྙམ་དུ་སེམས་བསྐྱེད་པ་དང་པོ་དེ་བསྐྱེད་ནས། བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ། ཐ་ན་ཆུ་ཕོར་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This is the first thought the bodhisatva cultivates, and so he applies himself to The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.”

source: ཁམས་ནི་སྦྲུལ་གདུག་མ་རུང་པ། །བཞི་པོ་གཅིག་ལ་གཅིག་བརྟེན་ཏེ། ། རེ་རེ་ཡང་ནི་འཁྲུགས་པ་ལས། །ནད་པོ་ཆེ་ནི་འབྱུང་བར་འགྱུར། །
en: “The four elements are in disarray, Interacting with one another other As if they were ravaged by a terrible poison, Bringing about a great deal of disease.

source: མིག་ནད་དང་ནི་རྣ་ནད་དང་། །སྣ་ནད་དང་ནི་དེ་བཞིན་དུ། །སོ་ནད་དང་ནི་མཆུ་ནད་རྣམས། །གཞན་ཡང་ལུས་ལས་འབྱུང་བར་འགྱུར། །
en: “Diseases of the eyes, Disorders of hearing and taste, Tooth decay, and infections of the lips— These and other things affect the body.

source: སྨྱོ་དང་འབྲས་དང་ཕོལ་མིག་དང་། །མེ་དབལ་གཡན་པ་རྣམས་དང་ནི། །ནད་གཞན་རྣམ་པ་མང་པོ་དག ། ལུས་ལས་སུ་ནི་འབྱུང་བར་འགྱུར། །
en: “Disorders, boils, and blisters, Infections and rashes— These and various other diseases Affect embodied beings.

source: ལུས་འདི་ནད་དང་མཚུངས་པ་སྟེ། །
en: “This body is like a sickness.

source: ལུས་ནི་འབྲུམ་བུ་འདྲ་བའོ། །
en: It is like a growing pustule.

source: ལུས་འདི་གནོད་པ་འདྲ་བ་སྟེ། །
en: This body is a wound,

source: ཡུན་ཐུང་སྐད་ཅིག་འདུས་པའོ། །
en: Transient and temporal.

source: དུར་ཁྲོད་དུ་ནི་འགྲོ་ཞིང་འཇིག །
en: “It will meet its end in the charnel ground.

source: མི་རྟག་མི་བརྟན་གཡོ་བ་སྟེ། །
en: It is impermanent, unstable, and transient.

source: རབ་ཏུ་འཇིག་ཅིང་ན་བ་དང་། །ལུས་འདི་རྣག་གིས་གང་བ་སྟེ། ། ཤིག་ཤིག་པོ་དང་ཡུན་ཐུང་བ། །རྣག་གིས་གང་བའི་ལུས་འདི་ཡིས། །སངས་རྒྱས་ཀྱི་ནི་སྐུ་ཡི་ཕྱིར། །
en: This body is full of pus, diseased and ruined. “I will therefore put it to good use, This body full of pus, Decaying and transient, And turn it into the cause of the body of awakening.

source: རྣག་གིས་གང་བའི་ལུས་འདི་ཡིས། །ཆོས་སྐུ་བསམ་གྱིས་མི་ཁྱབ་པ། །སངས་རྒྱས་ཀྱི་ནི་སྐུ་འགྲུབ་བོ།། །།གང་ན་གཞན་གྱིས་ཐོབ་མེད་པ། །
en: “By means of this pus-filled body, Overflowing with pollutants, The body of awakening, The inconceivable embodiment of the Dharma, is realized.

source: དེ་འདྲའི་ལུས་ནི་ཐོབ་པར་བྱ། །ཚ་བ་དག་ཀྱང་གང་སྒྲིབ་དང་། །བསིལ་བ་དག་ཀྱང་རབ་སྲུང་བ། །ལུས་འདི་ཡང་ནི་དགའ་བ་དང་། །འཆི་བདག་གིས་གཞོམ་པར་འགྱུར། །
en: “There is no other way I can attain such a body, Which offers shade from the burning heat And protects one from the cold. “One’s being will eventually Be overcome by old age and death.

source: གང་དག་གྲང་དང་ཚ་བཟོད་པ། །ལུས་ཀྱིས་སུ་ནི་ཐམས་ཅད་དུ། །སྐྱེས་བུའི་བྱ་བ་བྱེད་པ་ཡིས། །མཆོག་གི་ལུས་ནི་ཐོབ་པར་འགྱུར། །
en: But one who is able to endure all kinds Of physical hardships of cold and heat Can make use of the opportunities of this human state To attain the supreme body.
